-- Рефлексия по задачам 6.

-- Задача 2: Получение данных о гноме с навыками и назначениями
Сделал также.

-- Задача 3: Данные о мастерской с назначенными рабочими и проектами
Сделал аналогичным образом, кроме  wm.is_input = TRUE . Таблица вида "многие-ко-многим"
просто показывает отношение материала и мастерских. И наличие в базе этой связи не гарантирует наличие материала в мастерской.
За наличие отвечает флаг is_input.
  
-- Задача 4: Данные о военном отряде с составом и операциями
Сделал также.
